# git - Это система контроля версии
# репозиторий - это проект, в котором находятся изменения
# коммит - сохранить историю изменений в проекте в истории

# print("Hello World")

# gitflow - алгоритм работы с гитом, когда работаете в команде (или один)
# самые популярные варианты
# из master делают develop (нестабильная версия - черновик)


# print("Hello World1")
# print("Hello World2")

# megrge - это слияние с другими данными, который берет и коммиты, если нужна четка история изменений в последовательности
# минус мержа - будет полна история и много веток
# rebase - подгружает изменения, будто бы с меньшей историей и делает ее более чистой
# print("Hello qwerty")


# условия
# 1
# 1
# 1